{
    "python": "A high-level programming language used for general-purpose programming.",
    "algorithm": "A process or set of rules to be followed in problem-solving operations.",
    "variable": "An element, feature, or factor that is liable to vary or change.",
    "function": "A block of organized, reusable code that is used to perform a single, related action.",
    "recursion": "The process in which a function calls itself directly or indirectly.",
    "syntax": "The arrangement of words and phrases to create well-formed sentences in a language.",
    "inheritance": "A mechanism in object-oriented programming that allows one class to inherit properties and behavior from another.",
    "polymorphism": "The ability of different objects to respond to the same function in a different way.",
    "encapsulation": "The bundling of data with the methods that operate on that data.",
    "abstraction": "The process of hiding the implementation details and showing only functionality to the user.",
    "database": "An organized collection of structured information, or data, typically stored electronically.",
    "query": "A request for information from a database.",
    "index": "A data structure that improves the speed of data retrieval operations on a database.",
    "tuple": "An ordered collection of elements which is immutable in Python.",
    "list": "A collection of items which is ordered and changeable in Python.",
    "dictionary": "A collection of key-value pairs that is unordered, changeable, and indexed in Python.",
    "loop": "A sequence of instructions that repeats until a certain condition is met.",
    "iteration": "The repetition of a process or set of instructions in a program.",
    "class": "A blueprint for creating objects, providing initial values for state and implementations of behavior.",
    "object": "An instance of a class in object-oriented programming.",
    "module": "A file containing Python definitions and statements intended for use in other Python programs.",
    "package": "A namespace that organizes modules in a logical way, often stored in directories.",
    "framework": "A collection of prewritten code that developers can use to avoid writing from scratch.",
    "library": "A collection of precompiled routines that a program can use.",
    "exception": "An event that occurs during the execution of a program and disrupts its normal flow.",
    "try": "A block of code in Python used to handle exceptions.",
    "finally": "A block of code that runs after the try block regardless of whether an exception occurred.",
    "lambda": "An anonymous function in Python defined with the lambda keyword.",
    "comprehension": "A compact way to process all or part of the elements in a sequence and return a list.",
    "generator": "A function that returns an iterator and yields items one at a time.",
    "decorator": "A function that modifies the behavior of another function or method.",
    "closure": "A function object that has access to variables in its scope chain even after the outer function has finished.",
    "coroutine": "A generalization of subroutines for non-preemptive multitasking, used in Python for asynchronous programming.",
    "async": "A keyword in Python used to define a coroutine.",
    "await": "A keyword in Python used to pause the execution of a coroutine.",
    "bytecode": "The intermediate representation of a Python program that is interpreted by the Python virtual machine.",
    "compiler": "A program that translates high-level source code into machine code or bytecode.",
    "interpreter": "A program that executes instructions written in a programming language.",
    "jit": "Just-in-time compilation, a method of executing code that involves compiling code during execution of a program.",
    "functional": "A programming paradigm where programs are constructed by applying and composing functions.",
    "imperative": "A programming paradigm where commands are given to the computer in sequence.",
    "declarative": "A programming paradigm that expresses the logic of a computation without describing its control flow.",
    "debugging": "The process of finding and fixing bugs or errors in a program.",
    "api": "Application Programming Interface, a set of routines, protocols, and tools for building software and applications.",
    "json": "JavaScript Object Notation, a lightweight format for storing and transporting data.",
    "xml": "Extensible Markup Language, a format used to store and transport data, with a focus on simplicity and usability.",
    "csv": "Comma Separated Values, a simple format for storing tabular data in plain text.",
    "html": "HyperText Markup Language, the standard language for creating web pages.",
    "css": "Cascading Style Sheets, a language used for describing the presentation of a document written in HTML or XML.",
    "javascript": "A high-level, dynamic, untyped, and interpreted programming language, primarily used for web development.",
    "typescript": "A strict syntactical superset of JavaScript that adds optional static typing.",
    "react": "A JavaScript library for building user interfaces, primarily for web applications.",
    "angular": "A platform and framework for building single-page client applications using HTML and TypeScript.",
    "vue": "A progressive JavaScript framework for building user interfaces.",
    "node": "A JavaScript runtime built on Chrome's V8 JavaScript engine.",
    "npm": "Node Package Manager, the default package manager for the JavaScript runtime environment Node.js.",
    "docker": "A platform for developing, shipping, and running applications inside containers.",
    "kubernetes": "An open-source system for automating deployment, scaling, and management of containerized applications.",
    "linux": "An open-source operating system based on Unix.",
    "ubuntu": "A popular distribution of the Linux operating system.",
    "bash": "A Unix shell and command language used in the terminal.",
    "shell": "A program that interprets commands and acts as an interface between the user and the operating system.",
    "ssh": "Secure Shell, a protocol for securely connecting to remote systems over an unsecured network.",
    "git": "A distributed version control system for tracking changes in source code.",
    "github": "A web-based platform that provides hosting for software development version control using Git.",
    "bitbucket": "A web-based version control repository hosting service owned by Atlassian.",
    "merge": "A process in version control where changes from different branches are combined.",
    "branch": "A parallel version of a repository where developers can work independently on changes.",
    "commit": "A saved change or group of changes in a version control system.",
    "oauth": "An open standard for access delegation, commonly used for token-based authentication and authorization.",
    "jwt": "JSON Web Token, a compact, URL-safe means of representing claims to be transferred between two parties.",
    "rest": "Representational State Transfer, an architectural style for designing networked applications.",
    "graphql": "A query language for APIs that allows clients to request specific data.",
    "microservices": "An architectural style that structures an application as a collection of loosely coupled services.",
    "monolith": "An architectural style where an application is built as a single, unified unit.",
    "scalability": "The ability of a system to handle increased load by increasing resources.",
    "caching": "A process of storing copies of data in a temporary storage location to improve data retrieval performance.",
    "latency": "The delay before a transfer of data begins following an instruction for its transfer.",
    "throughput": "The amount of data transferred over a network in a given amount of time.",
    "bandwidth": "The maximum rate of data transfer across a given path.",
    "encryption": "The process of converting information or data into a code to prevent unauthorized access.",
    "decryption": "The process of converting encrypted data back into its original form.",
    "hashing": "A process of converting data into a fixed-size value, typically for comparison or authentication purposes.",
    "firewall": "A security system that monitors and controls incoming and outgoing network traffic based on security rules.",
    "vpn": "Virtual Private Network, a service that encrypts your internet connection and hides your online activity.",
    "ransomware": "A type of malicious software that threatens to publish the victim's data or perpetually block access unless a ransom is paid.",
    "phishing": "A fraudulent attempt to obtain sensitive information by disguising as a trustworthy entity in an electronic communication.",
    "trojan": "A type of malware that disguises itself as legitimate software to trick users into installing it."
}
